In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import pandas_profiling

In [6]:
df1= pd.DataFrame(np.array([[49,52,65,29], [44,62,48,69], [63,70,58,39]]),
                   columns=['a', 'b', 'c','d'])

In [7]:
df1

    a   b   c   d
0  49  52  65  29
1  44  62  48  69
2  63  70  58  39

In [12]:
df2=pd.DataFrame({'Name':['bharath','shameer','mujahid','syed'],
                         'age':[24,25,26,23]})

In [13]:
df2

      Name  age
0  bharath   24
1  shameer   25
2  mujahid   26
3     syed   23

In [14]:
a=pd.concat([df1,df2],axis=0,sort=False)

In [15]:
a

      a     b     c     d     Name   age
0  49.0  52.0  65.0  29.0      NaN   NaN
1  44.0  62.0  48.0  69.0      NaN   NaN
2  63.0  70.0  58.0  39.0      NaN   NaN
0   NaN   NaN   NaN   NaN  bharath  24.0
1   NaN   NaN   NaN   NaN  shameer  25.0
2   NaN   NaN   NaN   NaN  mujahid  26.0
3   NaN   NaN   NaN   NaN     syed  23.0

In [16]:
a=pd.concat([df1,df2],axis=1,sort=True)

In [17]:
a

      a     b     c     d     Name  age
0  49.0  52.0  65.0  29.0  bharath   24
1  44.0  62.0  48.0  69.0  shameer   25
2  63.0  70.0  58.0  39.0  mujahid   26
3   NaN   NaN   NaN   NaN     syed   23

In [18]:
x=pd.Series({'key1':'hello','key2':1234,'key3':9865,'key4':'python'})

In [19]:
x

key1     hello
key2      1234
key3      9865
key4    python
dtype: object

In [20]:
list(x)

['hello', 1234, 9865, 'python']

In [21]:
y=pd.Series([1,2,3,4,5,6])

In [22]:
y

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [23]:
list(y)

[1, 2, 3, 4, 5, 6]

In [24]:
tuple(y)

(1, 2, 3, 4, 5, 6)

In [27]:
d=np.array([1,2,3,4,5,6])

In [28]:
d

array([1, 2, 3, 4, 5, 6])

In [29]:
n=pd.Series(d)

In [30]:
n

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [39]:
k=pd.Series([1,2,'hello',4.6,6,np.nan])

In [40]:
k

0        1
1        2
2    hello
3      4.6
4        6
5      NaN
dtype: object

In [41]:
w=pd.to_numeric(k,errors='coerce')

In [42]:
w

0    1.0
1    2.0
2    NaN
3    4.6
4    6.0
5    NaN
dtype: float64

In [43]:
df=pd.DataFrame({'names':['sachin','virat','rohit'],
                'score':[104,88,89],
                'age':[45,30,31]})

In [44]:
df

    names  score  age
0  sachin    104   45
1   virat     88   30
2   rohit     89   31

In [46]:
df['age']

0    45
1    30
2    31
Name: age, dtype: int64

In [48]:
q=pd.Series(df['age'])

In [49]:
q

0    45
1    30
2    31
Name: age, dtype: int64

In [50]:
xy=pd.Series([1,2,3,4,5,6])

In [51]:
xy

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [52]:
z=np.array(xy)

In [53]:
z

array([1, 2, 3, 4, 5, 6], dtype=int64)

In [56]:
df1=pd.DataFrame([['hi','hello','thanks'],
                 ['abcd','efgh','jklm'],
                 ['how','what','where']])
print(df1)
df1.ndim

      0      1       2
0    hi  hello  thanks
1  abcd   efgh    jklm
2   how   what   where

2

In [59]:
a=df1.apply(pd.Series).stack().reset_index(drop=True)

In [60]:
a

0        hi
1     hello
2    thanks
3      abcd
4      efgh
5      jklm
6       how
7      what
8     where
dtype: object